doc.org
#+HTML_HEAD: -*- fill-column: 92 -*-

#+TITLE: moto

#+NAME: css
#+BEGIN_HTML
<link rel="stylesheet" type="text/css" href="css/css.css" />
#+END_HTML

* Мысли
Создаем самый посещаемый ресурс по мототематике. Сначала в С-Пб, потом в Москве.

Определить интересы целевой аудитории. Клубы, тусовки

Определить круг зарубежных ресурсов

Выйти на рекламодателей

Более демократичный ресурс чем мотобратан:
- модератор подписывается под баном
- можно баны обсуждать
- сообщество может отменить бан модератора!

Больше возможностей:
- поиск мотобратанов (ник, имя, район)
- кварталы по районам
- кварталы по технике
- прохваты - календарь
- карта с текущим положением прохватов

ЗАгрузка мануалов

Пользователи сами пишут себе сайт

Отметить как прочитанное

motozen

никакой рекламы

* Еще мысли

сайт, где собрано максимум (МАКСИМУМ) необходимой информации для мотоводителей. Как
результат этого будет достигнута цель - самый посещаемый ресурс.

НОВОСТИ - нужно, там стоит публиковать прессу, собственные статьи, если таковые будут,
объявления о предстоящих событиях, касающихся мотоциклистов в РФ и пр.
Все перечислить сложно, надо начать и в процессе работы будет ясно что нужно, а от чего
можно отказаться.

УСЛУГИ - в этом разделе инетсерфер должен увидеть, где какие гаражи можно арендовать, в
каких мастерских можно починиться, где есть мотошколы, где зарегистрироваться или
застраховаться и пр - то есть здесь надо собрать инфу обо всех услугах, которые могут
пригодиться водителю.

РЫНОК - здесь должна быть собрана информация с актуальными  ссылками и удобным, логичным,
рациональным поиском. Попавший в этот раздел явно хочет что-то купить. След-но, он должен
иметь возможность найти нужный продукт (не важно, мотоцикл или деталь к нему, шлем,
бронебойные трусы с кармашком для денег или прикольную наклейку для мотоцикла) по
наименованию или по названию фирмы.

ПРОХВАТЫ - тут вроде все ясно...
Мероприятия - я бы может объединила эти два раздела: Прохваты и Мероприятия, просто чтобы
не делать два раздела. Не знаю стоит ли, возможно не стоит.

БЛОГИ - публикации из различных блогов. В принципе, можно этот раздел отнести к новостному
(и расположить их рядом), а можно опять же объединить с Новостями. Тогда должна быть
сортировка новостей для удобства поиска (мало ли людям пригодится) Сортировать можно по
источникам, например - СМИ (то есть газеты и проч известные сми), блоги, новости сайта.

ВОПРОС-ОТВЕТ - что-то вроде быстрого форума, где есть возможность задать вопрос и получить
ответ, а не искать подходящую для этого тему на форуме.
Может оно и не надо, но мне кажется может пригодиться.

БАЗА УГОНОВ - наверняка полезная штука, как организовывать...
На мой взгляд там нужен поиск по гос номерам, по маркам, дате угона. Не очень представляю
откуда брать инфу кроме объявлений пользователей о том, что у них  или их знакомых угнали
байк. Плюс должна быть обратная связь с пострадавшим владельцем.

ГАЛЕРЕЯ - все любят фото и видео... Если можно, то стоит собирать видео из новостей и
блогов отдельно от видео пользователей. То есть должны быть видео из новостей, видео дтп с
регистраторов (это могут пользователи выкладывать), итоговые видео с мероприятий.Что
касается фото - в раздел Галерея можно включить пресловутый Флирт, но назвать его иначе,
хоть что-то вроде "На первый-второй рассчитайсь". То есть в фотоальбомов нужно несколько,
так называемый флирт, плюс доска объявлений (мало ли кто-то хочет что-то продать/купить,
но найти сам не может или не смог даже на сайте), фото с мероприятий,  соревнований и проч
событий. Определить сразу и полностью, что там должно быть - сложно, значит должна быть
возможность добавления фотоальбома или видеоальбома в любой момент. Админами есессно, не
участниками.

Еще один раздел сайта - Форум, но про него отдельно.

Форумы тоже делятся для удобства на разделы. Много их не нужно, штук 5 хватит.

Раздел Новости.
Подраздел1. СМИ, блоги - сюда копируются новости с сайта, чтобы их можно было
обсудить. Если давать на сайте комментировать каждую новость, то некоторые могут обрасти
длинной бородой из комментов, будет неудобно... Если можно сделать так, чтобы например,
после 5 комментов под новостью на сайте на форуме автоматически открывалась тема и комменты
можно было бы оставлять только там, а не под новостью на сайте - это было бы шикарно! Не
знаю как это сделать))
Можно не давать комментировать новости на сайте, а сразу под каждой новостью дать ссылку на
соотв-щую тему на форуме "Обсудить на форуме". На начальном этапе развития велика
вероятность, что так засорим форум темами без комментариев... что есть минус, потом
замучаемся чистить форум (хотя я не представляю пока точный объем ежедневных новостей,
возможно и не так много их будет).
Главное, что в этом подразделе новости публикуют администраторы.
Подраздел 2: ЧП, ДТП - вот здесь новости публикуют сами пользователи. На сайте это не
отражается, есессно.

Раздел Мотоциклы.  Подразделы:
Все о машинах, все о запчастях, советы по ремонту, доска объявлений (объявления серии
куплю/продам), мотошколы...
Какие еще здесь нужны подразделы - не знаю, я в общем определила, что должно быть. Дальше
на твое усмотрение.


Раздел Дорога.
Подраздел 1. Юридическая помощь. Здесь стоит собрать инфу, касающуюся мотоциклистов,
начиная от ПДД и заканчивая статьями и законами, поправками к ним и т.д.
Глядишь понадобится кому-то... Это будет что-то вроде своеобразного справочника.
В этом же подразделе нужно или сразу создать темку или написать где-то, что здесь можно
создавать темы для выяснения вопросов с дтп, защитой на суде и прочем. Советы будут давать
пользователи, поэтому надо сразу написать, что это не проф юристы, выслушайте и сами
думайте, доверять или нет, следовать или нет. И мол администрация НЕ несет ответственности
за верность советов/ответов/проч. Последнее особенно важно. Потому что кроме нас нашу
задницу не прикроет никто, если что.

Подраздел 2. Радары. Соот-но здесь должны быть темы с инфой о радарах от участников, плюс
фото с точкой на карте например.

Подраздел 3. Советы путешественников. В темах участники могут рассказать о собственных
путешействиях и обязательно дать какие-то советы (главное условие, если человек открывает
тему - дать совет или спросить совета. Просто бла-бла не приветсвуется). Или другие могут
задавать вопросы и ждать советов от бывалых. А может кто-то попутчиков искать будет, мало
ли...

Раздел О разном. Он нужен, как ни крути, людям надо дать волю хоть где-то))
Здесь могут быть следующие подразделы:
Спорт (не забыть писать здесь и о каскадерах, не только о спортивентах, шоу и прочем. Ну и
про циирк не забывать, есесно)
Интересности - интересные факты, рекорды, музеи, приколы, .... - все, что угодно, лишь бы с
мотоциклами связано было. Публиковать должны и участники, не только мы.
Поиск 1го, 2го с мотоцатниклом и без - тот же Флирт, только с обсуждениями, приколами и
прочее. Более свободная зона, чем в Галереее на сайте в фотоальбоме.
Курилка - флудилка, на всякие свободные темы. Да оно надо, пусть для души будет, здесь
должно быть минимум правил и ограничений, эдакая свободная зона.

Раздел Администрация. Подраздел - Вопросы, жалобы предложения.
Тут должна быть обратная связь с админами по любым вопросам. Тут же можно разместить
правила форума.
_____________________

О ПРАВИЛАХ.
Правила сайта должны быть на сайте и должны быть легко находимы. Если будет главная
страница - значит на ней должно быть написано, что есть правила и дана на них ссылка. Если
нет главной - значит оформлены как один из разделов (плюс этого в том, что люди будут
видеть, что правила есть. Нет-нет, да заглянут.
(ну или на каждой странице внизу давать ссылку на них, менее удобно, незаметно, читаться
будет мало, толку 2-5% фактически)

Сворачивать названия разделов как на сайте мотобратан - ни в коем случае не надо.Что-то
обязательно ускользнет от внимания серферов, и это минус работе над сайтом в целом.

Правила форума должны быть на форуме, при регистрации участник должен их прочитать, и пока
не поставит галочку Согласен/подтверждаю/прочел/понял/не дебил - регистрация не
завершится. Присылать их на почту автоматически после завершения регистрации - это 100%
гарантия того, что человек их не прочтет. Не присылать правила, не давать их читать при
регистрации - 200% гарантия того, что человек не будет знать об их существовании и искать
их не будет. Проверено временем, опытом, личными мыканьями по форумам....

* Введение
* Определения сущностей
** Функции для кодогенерации сущностей

   Эти функции будут кодогенерировать сущности и автоматы из таблиц с наименованием и
   типами полей внутри этого файла.

   Начнем с генерации кода из таблицы полей:

   #+NAME: gen_fields
   #+BEGIN_SRC emacs-lisp
     (defun gen-fields (table)
       (let ((rows (nthcdr 2 table)))
         (princ (format "(%s\n" (butlast (first rows))))
         (mapcar #'(lambda (x)
                     (princ (format " %s\n" (butlast x))))
                 (butlast (cdr rows)))
         (princ (format " %s)" (butlast (first (last rows)))))))
   #+END_SRC

   Теперь напишем код, который генерирует код для состояний конечного автомата:

   #+NAME: gen_states
   #+BEGIN_SRC emacs-lisp
     (defun gen-states (table)
       (let ((rows (nthcdr 2 table))
             (hash (make-hash-table :test #'equal))
             (states))
         (dolist (elt rows nil)
           (puthash (second elt) nil hash)
           (puthash (third elt)  nil hash))
         (maphash (lambda (k v)
                    (push k states))
                  hash)
         (princ "(")
         (dolist (elt (butlast states))
           (princ (format ":%s " elt)))
         (princ (format ":%s)" (car (last states))))))
   #+END_SRC

   И добавим к этом генератор действий - т.е. переходов между состояниями:

   #+NAME: gen_actions
   #+BEGIN_SRC emacs-lisp
     (defun gen-actions (table)
       (let ((rows (nthcdr 2 table)))
         (let ((x (car rows)))
           (princ (format "((:%s :%s :%s)" (second x) (third x) (first x))))
         (if (equal 1 (length rows))
             (princ ")\n")
             (progn
               (princ "\n")
               (mapcar #'(lambda (x)
                           (princ (format " (:%s :%s :%s)\n" (second x) (third x) (first x))))
                       (cdr (butlast rows)))
               (let ((x (car (last rows))))
                 (princ (format " (:%s :%s :%s))" (second x) (third x) (first x))))))))
   #+END_SRC

   Соберем все это в один файл:

   #+NAME: generators
   #+BEGIN_SRC emacs-lisp :tangle generators.el :noweb tangle :exports code
     <<gen_fields>>

     <<gen_states>>

     <<gen_actions>>
   #+END_SRC

   И загрузим его:
   #+NAME: generators
   #+BEGIN_SRC emacs-lisp
     (load-file "generators.el")
   #+END_SRC

** Пользователи (user)

   Для начала надо определиться, какие данные мы собираемся хранить о пользователях, и
   какого типа будут эти данные. Типы данных задаем в формате [[http://marijnhaverbeke.nl/postmodern/postmodern.html][Postmodern]] чтобы потом
   сохранить данные в =PostgreSQL=

   #+CAPTION: Данные пользователя
   #+NAME: user_data
     | field name | field type | note              |
     |------------+------------+-------------------|
     | id         | serial     | идентификатор     |
     | name       | varchar    | имя пользователя  |
     | password   | varchar    | пароль            |
     | email      | varchar    | емейл             |

   В нашей системе пользователь может существовать (или не существовать) в одном их
   нескольких состояний:
    + Когда пользователь еще не зарегистрирован на сайте мы можем считать его
      незарегистрированным (=unregistred=)
    + После регистрации он автоматически становится залогиненным (=logged=)
    + Пользователь может покинуть сайт и перейти в состояние =unlogged=
    + Пользователь может забыть свой пароль, тогда мы должны выслать ему ссылку для
      восстановления пароля (=sended=)
    + И наконец, после восстановления пароля пользователь вновь становится залогиненным
      (=logged=)

   Все эти переходы и состояния сведем в единую таблицу:

   #+CAPTION: Состояния конечного автомата пользователя
   #+NAME: user_state
     | action         | from        | to          |
     |----------------+-------------+-------------|
     | registration   | unregistred | logged      |
     | unregistration | logged      | unregistred |
     | enter          | unlogged    | logged      |
     | leave          | logged      | unlogged    |
     | forgot         | unlogged    | sended      |
     | remember       | sended      | logged      |

   Теперь мы можем полностью описать поведение пользователя как конечный автомат:

   #+NAME: user_state_graph
   #+BEGIN_SRC emacs-lisp :var table=user-state :results output :exports none
     (mapcar #'(lambda (x)
                 (princ (format "%s -> %s [label =\"%s\"];\n"
                                (second x) (third x) (first x))))
             (nthcdr 2 table))
   #+END_SRC

   #+BEGIN_SRC dot :file img/user-state.png :var input=user-state-graph :exports results
     digraph G {
       rankdir = LR;
       $input
     }
   #+END_SRC

   Сводя вместе, все что нам известно о пользователе (его поведение и поля) опишем все это
   в коде:

   #+NAME: user_automat
   #+BEGIN_SRC lisp
     (define-automat user "Автомат пользователя"
       <<user_fields()>>
       <<user_states()>>
       <<user_actions()>>)

      <<user_actions_func>>

      <<create_user>>
   #+END_SRC

   Где =user-fields= (поля данных) определим как:

   #+NAME: user_fields
   #+BEGIN_SRC emacs-lisp :var table=user_data :results output :exports results :tangle no
     (gen-fields table)
   #+END_SRC

   А =user-states= т.е. состояния пользователя определим так:

   #+NAME: user_states
   #+BEGIN_SRC emacs-lisp :var table=user_state :results output :exports results :tangle no
     (gen-states table)
   #+END_SRC

   И, наконец, определим =user-actions= переходы между состояниями:

   #+NAME: user_actions
   #+BEGIN_SRC emacs-lisp :var table=user_state :results output :exports results :tangle no
     (gen-actions table)
   #+END_SRC

   Теперь определим функции, которые вызываются на переходах

   #+NAME: user_actions_func
   #+BEGIN_SRC lisp
     (defun registration ()
       "unregistred -> logged"
       )

     (defun unregistration ()
       "logged -> unregistred"
       )

     (defun enter ()
       "unlogged -> logged"
       )

     (defun leave ()
       "logged -> unlogged"
       )

     (defun forgot ()
       "unlogged -> sended"
       )

     (defun remember ()
       "sended -> logged"
       )
   #+END_SRC

